/*****************************************************************************
*  <システム>   分散処理フレームワーク
*  <名称>	ダイナミックリンクライブラリ アクセスAPI
*  <目的>		
*  <機能>		
*  <開発環境>	UNIX
*  <特記事項>
*
*  VERSION	  DATE		BY			   CHANGE/COMMENT
*  -----------------------------------------------------------------------------
*  V0.00		2014/06/07  Takakusaki	   新規作成
******************************************************************************/
#include "xi_common.h"

/***************************************************************
 ローカル変数の定義
***************************************************************/
static void *s_dlhandle = NULL;

/***************************************************************
 ローカル関数プロトタイプ宣言
***************************************************************/
static void *dl_get_sym(const char *name);

/*****************************************************************************
*  <関数名> dl_get_sym
*  <機能>   シンボル取得
*  <説明>   ダイナミックオブジェクト中のシンボルを取得する
*  <引数>   name:I:関数名
*  <リターン値> NULL:異常
*	   NULL以外:正常
*  <備考>
******************************************************************************/
static void *dl_get_sym(const char *name) {

	if ( s_dlhandle == NULL ){ return NULL; }
	return dlsym(s_dlhandle,name);
}

/*****************************************************************************
*  <関数名> dl_open_so
*  <機能>   動的リンクの初期化
*  <説明>   動的リンクの初期化を行う
*  <引数>   なし
*  <リターン値> 0:正常
*	   0以外:異常
*  <備考>
******************************************************************************/
int dl_open(char *filename) {

	if ( s_dlhandle != NULL ){ return -1; }

	/* ファイルチェック */
	if ( filisFile(filename) != 1 ){ return -2; }

	/* 初期化 */
	s_dlhandle = dlopen(filename,RTLD_LAZY);
	if ( s_dlhandle == NULL ){ return -3; }
	return 0;
}

int dl_close() {
	int ret;
	if ( s_dlhandle == NULL ){ return -1; }
	if ( dlclose(s_dlhandle) == 0 ){
		s_dlhandle=NULL;
		return 0; 
	}
	return -2;
}


/*****************************************************************************
*  <関数名> dl_map
*  <機能>   MapReduceのMap処理
*  <説明>   
*  <引数>   なし
*  <リターン値> 0:正常
*	   0超:異常
*	   0未満:異常(処理終了)
*  <備考>
******************************************************************************/
int dl_map()
{
	return (*(int (*)())dl_get_sym("dl_map"))();
}


/*****************************************************************************
*  <関数名> dl_reduce
*  <機能>   MapReduceのReduce処理
*  <説明>   
*  <引数>   なし
*  <リターン値> 0:正常
*	   0超:異常
*	   0未満:異常(処理終了)
*  <備考>
******************************************************************************/
int dl_reduce()
{
	return (*(int (*)())dl_get_sym("dl_reduce"))();
}
