/*****************************************************************************
*  <システム>   分散処理フレームワーク
*  <名称>	セマフォロックAPI
*  <目的>
*  <機能>
*  <開発環境>	UNIX
*  <特記事項>	ipcの上位関数
*
*  VERSION      DATE            BY                      CHANGE/COMMENT
*  -----------------------------------------------------------------------------
*  V0.0.00      2014/01/18      Takakusaki				新規作成
******************************************************************************/
#include "xi_common.h"

/*****************************************************************************
 ローカル変数の定義
******************************************************************************/
static int l_semid=(-1);

/*****************************************************************************
*  <関数名>	semCreat
*  <機能>	セマフォ作成
*  <説明>	セマフォの作成を行う。
*  <引数>	
*		key_t:I:キー
*		nums:I:配列数
*  <リターン値> 
*		1:既に存在する
*		0:正常
*		-1:異常
*  <備考>
******************************************************************************/
int semCreat(key_t key,int nums)
{
	int ret;
	int i;

	/* セマフォ作成 */
	if ( (ret=ipcSemCreat(key, nums, &l_semid)) != 0){
		return ret;
	}

	return 0;
}

/*****************************************************************************
*  <関数名>	semOpen
*  <機能>	セマフォオープン
*  <説明>	セマフォのオープンを行う。
*  <引数>	key_t:I:キー
*  <リターン値> 
*		0:正常
*		-1:異常
*  <備考>
******************************************************************************/
int semOpen(key_t key )
{
	int ret;
	if ( l_semid != (-1) ) return 0;
	/* セマフォオープン */
	if ( (ret=ipcSemOpen(key, &l_semid)) != 0){
		return -1;
	}
	return 0;
}

/*****************************************************************************
*  <関数名>	semClose
*  <機能>	セマフォの削除
*  <説明>	セマフォを削除する
*  <引数>	なし
*  <リターン値> 
*		0:正常
*		-1:異常
*  <備考>
******************************************************************************/
int semClose()
{
	int ret;

	/* セマフォ作成前は終了 */
	if ( l_semid == (-1) ) return 0;

	/* セマフォ削除 */
	ret=ipcSemClose(l_semid);
	l_semid=(-1);
	if ( ret != 0 ){
		return -1;
	}
	return 0;
}

/*****************************************************************************
*  <関数名>	semLock
*  <機能>	共有資源のロック
*  <説明>	共有資源のロックを行う
*  <引数>	
*		smno:I:資源番号
*  <リターン値> 
*		0以上:正常
*		-1:異常
*  <備考>
******************************************************************************/
int semLock(int smno, int retry, int retrans)
{
	int ret;

	if ( l_semid == (-1) ){ return -1; }

	ret=ipcSemLock(l_semid, smno, retry, retrans);
	if ( ret < 0 ){ return -1; }
	return 0;
}

/*****************************************************************************
*  <関数名>	semUnLock
*  <機能>	共有資源のアンロック
*  <説明>	共有資源のアンロックを行う
*  <引数>	smno:I:資源番号
*  <リターン値> 
*		0:正常
*		-1:異常
*  <備考>
******************************************************************************/
int semUnLock(int smno, int retry, int retrans)
{
	int ret;
	if ( l_semid == (-1) ){ return -1; }

	ret=ipcSemUnLock(l_semid, smno, retry, retrans);
	if ( ret == (-2) ){ return -2; }
	if ( ret != 0 ){ return -1; }
	return 0;
}

/*****************************************************************************
*  <関数名>	semInfo
*  <機能>	セマフォ値取得
*  <説明>	現在のセマフォ値を取得する
*  <引数>	val:k:セマフォ値
*  <リターン値> 
*		0:正常
*		-1:異常
*  <備考>
******************************************************************************/
int semInfo(int *val )
{
	int ret;
	if ( l_semid == (-1) ){ return -1; }
	if ( (ret=ipcSemInf(l_semid, val)) != 0 ){ return -1; }
	return 0;
}
