/*****************************************************************************
*  <システム>   分散処理フレームワーク
*  <名称>	共有メモリアクセスAPI
*  <目的>	
*  <機能>	
*  <開発環境>	UNIX
*  <特記事項>	IPCの上位
*
*  VERSION	  DATE			BY					  CHANGE/COMMENT
*  -----------------------------------------------------------------------------
*  V0.0.00	  2014/01/18	  Takakusaki				新規作成
******************************************************************************/
#include "xi_common.h"

char *G_shmaddr=NULL;

/*****************************************************************************
 ローカル変数の定義
******************************************************************************/
static int l_shmid=(-1);

/*****************************************************************************
*  <関数名>	shmCreat
*  <機能>	共有メモリ作成
*  <説明>	共有メモリを作成し、グルーバルポインター変数にアドレスを設定する。
*  <引数>	
*		key_t:I:キー
*		size:I:サイズ
*  <リターン値> 
*		1:既に存在
*		0:正常
*		-1:異常
*  <備考>
******************************************************************************/
int shmCreat(key_t key, int size)
{
	int ret;
	int i;

	/* 既にアタッチされている場合は削除 */
	if ( l_shmid != (-1) ){
		if ( (ret=ipcShmClose(l_shmid, G_shmaddr)) != 0 ){ return -1; }
		l_shmid=(-1);
		G_shmaddr=NULL;
	}
	
	/* 共有メモリ作成 */
	ret=ipcShmCreat(key, size, &l_shmid);
	if ( ret != 0){ return ret; }

	/* 共有メモリのアタッチ */
	G_shmaddr=ipcShmAttch(l_shmid);
	if ( G_shmaddr == NULL ){
		l_shmid=(-1);
		return -1;
	}

	/* 共有メモリエリア初期化 */
	memset(G_shmaddr,0,size);

	return 0;
}

/*****************************************************************************
*  <関数名>	shmOpen
*  <機能>	共有メモリのアタッチ
*  <説明>	共有メモリをオープンし、グルーバルポインター変数にアドレスを設定する。
*  <引数>	
*		key_t:I:キー
*  <リターン値> 
*		0:正常
*		-1:異常
*  <備考>
******************************************************************************/
int shmOpen(key_t key)
{
	int ret;

	/* 既にアタッチされている */
	if ( l_shmid != (-1) ) return 0;

	/* 共有メモリのオープン */
	if ( (ret=ipcShmOpen(key, &l_shmid)) != 0){
		return -1;
	}

	/* 共有メモリのアタッチ */
	G_shmaddr=ipcShmAttch(l_shmid);
	if ( G_shmaddr == NULL ){
		l_shmid=(-1);
		return -1;
	}

	return 0;
}

/*****************************************************************************
*  <関数名>	shmDelete
*  <機能>	共有メモリの削除
*  <説明>	共有メモリが存在する場合は削除
*  <引数>	
*		key_t:I:キー
*  <リターン値> 
*		0:正常
*		-1:異常
*  <備考>
******************************************************************************/
int shmDelete(key_t key)
{
	int id;
	int ret;
	char *addr=NULL;

	if ( (ret=ipcShmOpen(key, &id)) != 0){
		return 0;
	}
	if ( (addr=ipcShmAttch(id)) == NULL ){
		return -1;
	}
	if ( (ret=ipcShmClose(id, addr)) != 0 ){
		return -1;
	}
	return 0;
}

/*****************************************************************************
*  <関数名>	shmClose
*  <機能>	共有メモリの削除
*  <説明>	共有メモリをデタッチし削除する。
*  <引数>	なし
*  <リターン値> 
*		0:正常
*		-1:異常
*  <備考>
******************************************************************************/
int shmClose()
{
	int ret;

	/* 共有メモリアタッチ前の場合は終了 */
	if ( l_shmid == (-1) ) return 0;
	if ( G_shmaddr == NULL ) return 0;

	/* 共有メモリ削除 */
	ret=ipcShmClose(l_shmid, G_shmaddr);
	l_shmid=(-1);
	G_shmaddr=NULL;
	if ( ret != 0 ){ return -1;
	}
	return 0;
}

/*****************************************************************************
*  <関数名>	shmFin
*  <機能>	共有メモリのデタッチ
*  <説明>	共有メモリをデタッチする。
*  <引数>	なし
*  <リターン値> 
*		0:正常
*		-1:異常
*  <備考>
******************************************************************************/
int shmFin()
{
	int ret;

	/* 共有メモリアタッチ前の場合は終了 */
	if ( l_shmid == (-1) ) return 0;
	if ( G_shmaddr == NULL ) return 0;

	/* 共有メモリデタッチ */
	ret=ipcShmFin(G_shmaddr);
	l_shmid=(-1);
	G_shmaddr=NULL;
	if ( ret != 0 ){ return -1; }

	return 0;
}

/*****************************************************************************
*  <関数名>	shmGetAttch
*  <機能>	共有メモリアタッチ数取得
*  <説明>	共有メモリをアタッチしているプロセス数を取得する
*  <引数>	なし
*  <リターン値> 
*		-1:異常
*		0以上:アタッチ数
*  <備考>	
******************************************************************************/
int shmGetAttch()
{
	int val;
	int cpid;
	int ret;

	if ( l_shmid == (-1) ){ return -1; }
	if ( (ret=ipcShmInfo(l_shmid, &val, &cpid)) != 0){ return -1; }
	return val;
}

/*****************************************************************************
*  <関数名>	shmGetCpid
*  <機能>	共有メモリ作成者取得
*  <説明>	共有メモリを作成したプロセスのPIDを取得する
*  <引数>	なし
*  <リターン値> 
*		-1:異常
*		0以上:PID
*  <備考>	
******************************************************************************/
int shmGetCpid()
{
	int val;
	int cpid;
	int ret;

	if ( l_shmid == (-1) ){ return -1; }
	if ( (ret=ipcShmInfo(l_shmid, &val, &cpid)) != 0){
		return -1;
	}
	return cpid;
}
